## left anti-join

### isin() method

In [1]:
# importing packages 
import pandas as pd

In [2]:
df1 = pd.DataFrame({ 
    "city": ["new york", "chicago", "orlando", 'mumbai'], 
    "temperature": [21, 14, 35, 30], 
    "humidity": [65, 68, 75, 75], 
})
df1

       city  temperature  humidity
0  new york           21        65
1   chicago           14        68
2   orlando           35        75
3    mumbai           30        75

In [3]:
df2 = pd.DataFrame({ 
    "city": ["chicago", "new york", "orlando"], 
    "humidity": [67, 60, 70] 
})
df2

       city  humidity
0   chicago        67
1  new york        60
2   orlando        70

In [4]:
df3 = df1.merge(df2, on='city', how='left', indicator=True) 
df3

       city  temperature  humidity_x  humidity_y     _merge
0  new york           21          65        60.0       both
1   chicago           14          68        67.0       both
2   orlando           35          75        70.0       both
3    mumbai           30          75         NaN  left_only

In [5]:
df3['_merge'] == 'left_only'

0    False
1    False
2    False
3     True
Name: _merge, dtype: bool

In [6]:
df = df3.loc[df3['_merge'] == 'left_only', 'city'] 
df

3    mumbai
Name: city, dtype: object

In [7]:
d = df1[df1['city'].isin(df)]
d

     city  temperature  humidity
3  mumbai           30        75